codeljo/riscv-bare-metal/esp32c2/include/registers.inc
######################################################
# Timer Group (TIMG)
# (TRM 233) (timer group 0)
# (note: inserted a 0 to the register names)
######################################################
.equ TIMG0_BASE,             0x6001F000
# T0 control and configuration registers
.equ TIMG0_T0CONFIG_REG,     0x6001F000
.equ TIMG0_T0LO_REG,         0x6001F004
.equ TIMG0_T0HI_REG,         0x6001F008
.equ TIMG0_T0UPDATE_REG,     0x6001F00C
.equ TIMG0_T0ALARMLO_REG,    0x6001F010
.equ TIMG0_T0ALARMHI_REG,    0x6001F014
.equ TIMG0_T0LOADLO_REG,     0x6001F018
.equ TIMG0_T0LOADHI_REG,     0x6001F01C
.equ TIMG0_T0LOAD_REG,       0x6001F020
# WDT control and configuration registers
.equ TIMG0_WDTCONFIG0_REG,   0x6001F048
.equ TIMG0_WDTCONFIG1_REG,   0x6001F04C
.equ TIMG0_WDTCONFIG2_REG,   0x6001F050
.equ TIMG0_WDTCONFIG3_REG,   0x6001F054
.equ TIMG0_WDTCONFIG4_REG,   0x6001F058
.equ TIMG0_WDTCONFIG5_REG,   0x6001F05C
.equ TIMG0_WDTFEED_REG,      0x6001F060
.equ TIMG0_WDTWPROTECT_REG,  0x6001F064
# RTC frequency calculation control and configuration registers
.equ TIMG0_RTCCALICFG_REG,   0x6001F068
.equ TIMG0_RTCCALICFG1_REG,  0x6001F06C
.equ TIMG0_RTCCALICFG2_REG,  0x6001F080
# Interrupt registers
.equ TIMG0_INT_ENA_TIMERS_REG, 0x6001F070
.equ TIMG0_INT_RAW_TIMERS_REG, 0x6001F074
.equ TIMG0_INT_ST_TIMERS_REG,  0x6001F078
.equ TIMG0_INT_CLR_TIMERS_REG, 0x6001F07C
# Version register
.equ TIMG0_NTIMERS_DATE_REG,   0x6001F0F8
# Clock configuration registers
.equ TIMG0_REGCLK_REG,         0x6001F0FC
######################################################

######################################################
# System Registers (SYSREG)
# (TRM 254)
######################################################
.equ SYSTEM_BASE,                        0x600C0000
# Peripheral Clock Control Registers
.equ SYSTEM_CPU_PERI_CLK_EN_REG,         0x600C0000
.equ SYSTEM_CPU_PERI_RST_EN_REG,         0x600C0004
.equ SYSTEM_PERIP_CLK_EN0_REG,           0x600C0010
.equ SYSTEM_PERIP_CLK_EN1_REG,           0x600C0014
.equ SYSTEM_PERIP_RST_EN0_REG,           0x600C0018
.equ SYSTEM_PERIP_RST_EN1_REG,           0x600C001C
.equ SYSTEM_GDMA_CTRL_REG,               0x600C003C
.equ SYSTEM_CACHE_CONTROL_REG,           0x600C0040
#  Clock Configuration Registers
.equ SYSTEM_CPU_PER_CONF_REG,            0x600C0008
.equ SYSTEM_SYSCLK_CONF_REG,             0x600C0058
# CPU Interrupt Control Registers
.equ SYSTEM_CPU_INTR_FROM_CPU_0_REG,     0x600C0028
.equ SYSTEM_CPU_INTR_FROM_CPU_1_REG,     0x600C002C
.equ SYSTEM_CPU_INTR_FROM_CPU_2_REG,     0x600C0030
.equ SYSTEM_CPU_INTR_FROM_CPU_3_REG,     0x600C0034
# System and Memory Control Registers
.equ SYSTEM_EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROL_REG, 0x600C0044
# Clock Gate Control Register
.equ SYSTEM_CLOCK_GATE_REG,              0x600C0054
# Date Register
.equ SYSTEM_DATE_REG,                    0x600C0FFc

# The addresses below are relative to the base address of apb control
# base address is SYSCON (0x60026000)
.equ SYSCON_CLKGATE_FORCE_ON_REG,        0x600260A4
.equ SYSCON_MEM_POWER_DOWN_REG,          0x600260A8
.equ SYSCON_MEM_POWER_UP_REG,            0x600260AC
######################################################

######################################################
# Debug Assistant (ASSIST_DEBUG)
# (TRM 266)
######################################################
.equ ASSIST_DEBUG_BASE,                          0x600CE000
# Monitor configuration registers
.equ ASSIST_DEBUG_CORE_0_SP_MONITOR_EN_REG,      0x600CE000
.equ ASSIST_DEBUG_CORE_0_SP_MIN_REG,             0x600CE010
.equ ASSIST_DEBUG_CORE_0_SP_MAX_REG,             0x600CE014
.equ ASSIST_DEBUG_CORE_0_SP_PC_REG,              0x600CE018
# Interrupt configuration registers
.equ ASSIST_DEBUG_CORE_0_INTR_RAW_REG,           0x600CE004
.equ ASSIST_DEBUG_CORE_0_INTR_ENA_REG,           0x600CE008
.equ ASSIST_DEBUG_CORE_0_INTR_CLR_REG,           0x600CE00C
# PC logging configuration register
.equ ASSIST_DEBUG_CORE_0_RCD_EN_REG,             0x600CE01C
# PC logging status registers
.equ ASSIST_DEBUG_CORE_0_RCD_PDEBUGPC_REG,       0x600CE020
.equ ASSIST_DEBUG_CORE_0_RCD_PDEBUGSP_REG,       0x600CE024
# CPU Status Registers
.equ ASSIST_DEBUG_CORE_0_LASTPC_BEFORE_EXCEPTION_REG, 0x600CE028
.equ ASSIST_DEBUG_CORE_0_DEBUG_MODE_REG,         0x600CE02C
# Clock gate register
.equ ASSIST_DEBUG_CLOCK_GATE_REG,                0x600CE030
# Version register
.equ ASSIST_DEBUG_DATE_REG,                      0x600CE1FC
######################################################

######################################################
# ECC Hardware Accelerator (ECC)
# (TRM 279)
######################################################
.equ ECC_BASE,                         0x6003E000
# Interrupt registers
.equ ECC_MULT_INT_RAW_REG,             0x6003E00C
.equ ECC_MULT_INT_ST_REG,              0x6003E010
.equ ECC_MULT_INT_ENA_REG,             0x6003E014
.equ ECC_MULT_INT_CLR_REG,             0x6003E018
# Configuration register
.equ ECC_MULT_CONF_REG,                0x6003E01C
# Version register
.equ ECC_MULT_DATE_REG,                0x6003E0FC
######################################################

######################################################
# SHA Accelerator (SHA)
# (TRM 287)
######################################################
.equ SHA_BASE,                 0x6003B000
# Control/Status registers
.equ SHA_CONTINUE_REG,         0x6003B014
.equ SHA_BUSY_REG,             0x6003B018
.equ SHA_DMA_START_REG,        0x6003B01C
.equ SHA_START_REG,            0x6003B010
.equ SHA_DMA_CONTINUE_REG,     0x6003B020
.equ SHA_INT_CLEAR_REG,        0x6003B024
.equ SHA_INT_ENA_REG,          0x6003B028
# Versoin Register
.equ SHA_DATE_REG,             0x6003B02C
# Configuration Registers
.equ SHA_MODE_REG,             0x6003B000
# Data Registers
.equ SHA_DMA_BLOCK_NUM_REG,    0x6003B00C
.equ SHA_H_0_REG,              0x6003B040
.equ SHA_H_1_REG,              0x6003B044
.equ SHA_H_2_REG,              0x6003B048
.equ SHA_H_3_REG,              0x6003B04C
.equ SHA_H_4_REG,              0x6003B050
.equ SHA_H_5_REG,              0x6003B054
.equ SHA_H_6_REG,              0x6003B058
.equ SHA_H_7_REG,              0x6003B05C
.equ SHA_M_0_REG,              0x6003B080
.equ SHA_M_1_REG,              0x6003B084
.equ SHA_M_2_REG,              0x6003B088
.equ SHA_M_3_REG,              0x6003B08C
.equ SHA_M_4_REG,              0x6003B090
.equ SHA_M_5_REG,              0x6003B094
.equ SHA_M_6_REG,              0x6003B098
.equ SHA_M_7_REG,              0x6003B09C
.equ SHA_M_8_REG,              0x6003B0A0
.equ SHA_M_9_REG,              0x6003B0A4
.equ SHA_M_10_REG,             0x6003B0A8
.equ SHA_M_11_REG,             0x6003B0AC
.equ SHA_M_12_REG,             0x6003B0B0
.equ SHA_M_13_REG,             0x6003B0B4
.equ SHA_M_14_REG,             0x6003B0B8
.equ SHA_M_15_REG,             0x6003B0BC
######################################################

######################################################
# External Memory Encryption and Decryption (XTS_AES)
# (TRM 297)
######################################################
.equ XTS_AES_BASE,            0x600CC000
# Plaintext Register Heap
.equ XTS_AES_PLAIN_0_REG,     0x600CC000
.equ XTS_AES_PLAIN_0_REG,     0x600CC004
.equ XTS_AES_PLAIN_0_REG,     0x600CC008
.equ XTS_AES_PLAIN_0_REG,     0x600CC00C
.equ XTS_AES_PLAIN_0_REG,     0x600CC010
.equ XTS_AES_PLAIN_0_REG,     0x600CC014
.equ XTS_AES_PLAIN_0_REG,     0x600CC018
.equ XTS_AES_PLAIN_0_REG,     0x600CC01C
# Configuration Registers
.equ XTS_AES_LINESIZE_REG,    0x600CC040
.equ XTS_AES_DESTINATION_REG, 0x600CC044
.equ XTS_AES_PHYSICAL_ADDRESS_REG, 0x600CC048
# Control/Status Registers
.equ XTS_AES_TRIGGER_REG,     0x600CC04C
.equ XTS_AES_RELEASE_REG,     0x600CC050
.equ XTS_AES_DESTROY_REG,     0x600CC054
.equ XTS_AES_STATE_REG,       0x600CC058
# Version Register
.equ XTS_AES_DATE_REG,        0x600CC05C
######################################################

######################################################
# Random Number Generator (RNG)
# (TRM 302)
######################################################
.equ RNG_DATA_REG, 0x600260B0
######################################################

######################################################
# UART Controller (UART)
# (TRM 321)
######################################################
.equ UART0_BASE,               0x60000000
.equ UART1_BASE,               0x60010000

