codeljo/riscv-bare-metal/esp32c2/include/registers.inc
# UART0
# FIFO Configuration
.equ UART0_FIFO_REG,           0x60000000
.equ UART0_MEM_CONF_REG,       0x60000060
# UART Interrupt Register
.equ UART0_INT_RAW_REG,        0x60000004
.equ UART0_INT_ST_REG,         0x60000008
.equ UART0_INT_ENA_REG,        0x6000000C
.equ UART0_INT_CLR_REG,        0x60000010
# Configuration Register
.equ UART0_CLKDIV_REG,         0x60000014
.equ UART0_RX_FILT_REG,        0x60000018
.equ UART0_CONF0_REG,          0x60000020
.equ UART0_CONF1_REG,          0x60000024
.equ UART0_FLOW_CONF_REG,      0x60000034
.equ UART0_SLEEP_CONF_REG,     0x60000038
.equ UART0_SWFC_CONF0_REG,     0x6000003C
.equ UART0_SWFC_CONF1_REG,     0x60000040
.equ UART0_TXBRK_CONF_REG,     0x60000044
.equ UART0_IDLE_CONF_REG,      0x60000048
.equ UART0_RS485_CONF_REG,     0x6000004C
.equ UART0_CLK_CONF_REG,       0x60000078
# Status Register
.equ UART0_STATUS_REG,         0x6000001C
.equ UART0_MEM_TX_STATUS_REG,  0x60000064
.equ UART0_MEM_RX_STATUS_REG,  0x60000068
.equ UART0_FSM_STATUS_REG,     0x6000006C
# Autobaud Register
.equ UART0_LOWPULSE_REG,       0x60000028
.equ UART0_HIGHPULSE_REG,      0x6000002C
.equ UART0_RXD_CNT_REG,        0x60000030
.equ UART0_POSPULSE_REG,       0x60000070
.equ UART0_NEGPULSE_REG,       0x60000074
# AT Escape Sequence Selection Configuration
.equ UART0_AT_CMD_PRECNT_REG,  0x60000050
.equ UART0_AT_CMD_POSTCNT_REG, 0x60000054
.equ UART0_AT_CMD_GAPTOUT_REG, 0x60000058
.equ UART0_AT_CMD_CHAR_REG,    0x6000005C
# Version Register
.equ UART0_DATE_REG,           0x6000007C
.equ UART0_ID_REG,             0x60000080

# UART1
# FIFO Configuration
.equ UART1_FIFO_REG,           0x60010000
.equ UART1_MEM_CONF_REG,       0x60010060
# UART Interrupt Register
.equ UART1_INT_RAW_REG,        0x60010004
.equ UART1_INT_ST_REG,         0x60010008
.equ UART1_INT_ENA_REG,        0x6001000C
.equ UART1_INT_CLR_REG,        0x60010010
# Configuration Register
.equ UART1_CLKDIV_REG,         0x60010014
.equ UART1_RX_FILT_REG,        0x60010018
.equ UART1_CONF0_REG,          0x60010020
.equ UART1_CONF1_REG,          0x60010024
.equ UART1_FLOW_CONF_REG,      0x60010034
.equ UART1_SLEEP_CONF_REG,     0x60010038
.equ UART1_SWFC_CONF0_REG,     0x6001003C
.equ UART1_SWFC_CONF1_REG,     0x60010040
.equ UART1_TXBRK_CONF_REG,     0x60010044
.equ UART1_IDLE_CONF_REG,      0x60010048
.equ UART1_RS485_CONF_REG,     0x6001004C
.equ UART1_CLK_CONF_REG,       0x60010078
# Status Register
.equ UART1_STATUS_REG,         0x6001001C
.equ UART1_MEM_TX_STATUS_REG,  0x60010064
.equ UART1_MEM_RX_STATUS_REG,  0x60010068
.equ UART1_FSM_STATUS_REG,     0x6001006C
# Autobaud Register
.equ UART1_LOWPULSE_REG,       0x60010028 
.equ UART1_HIGHPULSE_REG,      0x6001002C
.equ UART1_RXD_CNT_REG,        0x60010030
.equ UART1_POSPULSE_REG,       0x60010070
.equ UART1_NEGPULSE_REG,       0x60010074
# AT Escape Sequence Selection Configuration
.equ UART1_AT_CMD_PRECNT_REG,  0x60010050
.equ UART1_AT_CMD_POSTCNT_REG, 0x60010054
.equ UART1_AT_CMD_GAPTOUT_REG, 0x60010058
.equ UART1_AT_CMD_CHAR_REG,    0x6001005C
# Version Register
.equ UART1_DATE_REG,           0x6001007C
.equ UART1_ID_REG,             0x60010080
######################################################

######################################################
# SPI Controller (SPI)
# (TRM 382)
# (note: inserted a 2 to the register names)
######################################################
.equ SPI0_BASE,               0x60003000 # not usable?
.equ SPI1_BASE,               0x60002000 # not usable?
.equ SPI2_BASE,               0x60024000
# User-defined control registers
.equ SPI2_CMD_REG,            0x60024000
.equ SPI2_ADDR_REG,           0x60024004
.equ SPI2_USER_REG,           0x60024010
.equ SPI2_USER1_REG,          0x60024014
.equ SPI2_USER2_REG,          0x60024018
# Control and configuration registers
.equ SPI2_CTRL_REG,           0x60024008
.equ SPI2_MS_DLEN_REG,        0x6002401C
.equ SPI2_MISC_REG,           0x60024020
.equ SPI2_DMA_CONF_REG,       0x60024030
.equ SPI2_SLAVE_REG,          0x600240E0
.equ SPI2_SLAVE1_REG,         0x600240E4
# Clock control registers
.equ SPI2_CLOCK_REG,          0x6002400C
.equ SPI2_CLK_GATE_REG,       0x600240E8
# Timing registers
#.equ SPI2_DIN_MODE_REG,       0x60024024
#.equ SPI2_DIN_NUM_REG,        0x60024028
#.equ SPI2_DOUT_MODE_REG,      0x6002402C
# Interrupt registers
.equ SPI2_DMA_INT_ENA_REG,    0x60024034
.equ SPI2_DMA_INT_CLR_REG,    0x60024038
.equ SPI2_DMA_INT_RAW_REG,    0x6002403C
.equ SPI2_DMA_INT_ST_REG,     0x60024040
.equ SPI2_DMA_INT_SET_REG,    0x60024044
# CPU-controlled data buffer
.equ SPI2_W0_REG,             0x60024098
.equ SPI2_W1_REG,             0x6002409C
.equ SPI2_W2_REG,             0x600240A0
.equ SPI2_W3_REG,             0x600240A4
.equ SPI2_W4_REG,             0x600240A8
.equ SPI2_W5_REG,             0x600240AC
.equ SPI2_W6_REG,             0x600240B0
.equ SPI2_W7_REG,             0x600240B4
.equ SPI2_W8_REG,             0x600240B8
.equ SPI2_W9_REG,             0x600240BC
.equ SPI2_W10_REG,            0x600240C0
.equ SPI2_W11_REG,            0x600240C4
.equ SPI2_W12_REG,            0x600240C8
.equ SPI2_W13_REG,            0x600240CC
.equ SPI2_W14_REG,            0x600240D0
.equ SPI2_W15_REG,            0x600240D4
# Version register
.equ SPI2_DATE_REG,           0x600240F0
######################################################

######################################################
# I2C Controller (I2C)
# (TRM 435)
######################################################
.equ I2C_BASE,                     0x60013000
# Timing Registers
.equ I2C_SCL_LOW_PERIOD_REG,       0x60013000
.equ I2C_SDA_HOLD_REG,             0x60013030
.equ I2C_SDA_SAMPLE_REG,           0x60013034
.equ I2C_SCL_HIGH_PERIOD_REG,      0x60013038
.equ I2C_SCL_START_HOLD_REG,       0x60013040
.equ I2C_SCL_RSTART_SETUP_REG,     0x60013044
.equ I2C_SCL_STOP_HOLD_REG,        0x60013048
.equ I2C_SCL_STOP_SETUP_REG,       0x6001304C
.equ I2C_SCL_ST_TIME_OUT_REG,      0x60013078
.equ I2C_SCL_MAIN_ST_TIME_OUT_REG, 0x6001307C
# Configuration Registers
.equ I2C_CTR_REG,                  0x60013004
.equ I2C_TO_REG,                   0x6001300C
.equ I2C_FIFO_CONF_REG,            0x60013018
.equ I2C_FILTER_CFG_REG,           0x60013050
.equ I2C_CLK_CONF_REG,             0x60013054
.equ I2C_SCL_SP_CONF_REG,          0x60013080
# Status Registers
.equ I2C_SR_REG,                   0x60013008
.equ I2C_FIFO_ST_REG,              0x60013014
.equ I2C_DATA_REG,                 0x6001301C
# Interrupt Registers
.equ I2C_INT_RAW_REG,              0x60013020
.equ I2C_INT_CLR_REG,              0x60013024
.equ I2C_INT_ENA_REG,              0x60013028
.equ I2C_INT_STATUS_REG,           0x6001302C
# Command Registers
.equ I2C_COMD0_REG,                0x60013058
.equ I2C_COMD1_REG,                0x6001305C
.equ I2C_COMD2_REG,                0x60013060
.equ I2C_COMD3_REG,                0x60013064
.equ I2C_COMD4_REG,                0x60013068
.equ I2C_COMD5_REG,                0x6001306C
.equ I2C_COMD6_REG,                0x60013070
.equ I2C_COMD7_REG,                0x60013074
# Address Registers
.equ I2C_TXFIFO_START_ADDR_REG,    0x60013100
.equ I2C_RXFIFO_START_ADDR_REG,    0x60013180
# Version Register
.equ I2C_DATE_REG,                 0x600130F8
######################################################

######################################################
# LED PWM Controller (LEDC)
# (TRM 463)
######################################################
.equ LEDC_BASE,                        0x60019000
# Configuration Register
.equ LEDC_CH0_CONF0_REG,               0x60019000
.equ LEDC_CH0_CONF1_REG,               0x6001900C
.equ LEDC_CH1_CONF0_REG,               0x60019014
.equ LEDC_CH1_CONF1_REG,               0x60019020
.equ LEDC_CH2_CONF0_REG,               0x60019028
.equ LEDC_CH2_CONF1_REG,               0x60019034
.equ LEDC_CH3_CONF0_REG,               0x6001903C
.equ LEDC_CH3_CONF1_REG,               0x60019048
.equ LEDC_CH4_CONF0_REG,               0x60019050
.equ LEDC_CH4_CONF1_REG,               0x6001905C
.equ LEDC_CH5_CONF0_REG,               0x60019064
.equ LEDC_CH5_CONF1_REG,               0x60019070
.equ LEDC_CONF_REG,                    0x600190D0
# Hpoint Register
.equ LEDC_CH0_HPOINT_REG,              0x60019004
.equ LEDC_CH1_HPOINT_REG,              0x60019018
.equ LEDC_CH2_HPOINT_REG,              0x6001902C
.equ LEDC_CH3_HPOINT_REG,              0x60019040
.equ LEDC_CH4_HPOINT_REG,              0x60019054
.equ LEDC_CH5_HPOINT_REG,              0x60019068
# Duty Cycle Register
.equ LEDC_CH0_DUTY_REG,                0x60019008
.equ LEDC_CH0_DUTY_R_REG,              0x60019010
.equ LEDC_CH1_DUTY_REG,                0x6001901C
.equ LEDC_CH1_DUTY_R_REG,              0x60019024
.equ LEDC_CH2_DUTY_REG,                0x60019030
.equ LEDC_CH2_DUTY_R_REG,              0x60019038
.equ LEDC_CH3_DUTY_REG,                0x60019044
.equ LEDC_CH3_DUTY_R_REG,              0x6001904C
.equ LEDC_CH4_DUTY_REG,                0x60019058
.equ LEDC_CH4_DUTY_R_REG,              0x60019060
.equ LEDC_CH5_DUTY_REG,                0x6001906C
.equ LEDC_CH5_DUTY_R_REG,              0x60019074
# Timer Register
.equ LEDC_TIMER0_CONF_REG,             0x600190A0
.equ LEDC_TIMER0_VALUE_REG,            0x600190A4
.equ LEDC_TIMER1_CONF_REG,             0x600190A8
.equ LEDC_TIMER1_VALUE_REG,            0x600190AC
.equ LEDC_TIMER2_CONF_REG,             0x600190B0
.equ LEDC_TIMER2_VALUE_REG,            0x600190B4
.equ LEDC_TIMER3_CONF_REG,             0x600190B8
.equ LEDC_TIMER3_VALUE_REG,            0x600190BC
# Interrupt Register
.equ LEDC_INT_RAW_REG,                 0x600190C0
.equ LEDC_INT_ST_REG,                  0x600190C4
.equ LEDC_INT_ENA_REG,                 0x600190C8
.equ LEDC_INT_CLR_REG,                 0x600190CC
# Version Register
.equ LEDC_DATE_REG,                    0x600190FC
######################################################

######################################################
# On-Chip Sensor and Analog Signal Processing
# (TRM 480)
######################################################
.equ ADC_BASE, 0x60040000
# Configuration Registers
.equ APB_SARADC_CTRL_REG,              0x60040000
.equ APB_SARADC_CTRL2_REG,             0x60040004
.equ APB_SARADC_FILTER_CTRL1_REG,      0x60040008
.equ APB_SARADC_SAR_PATT_TAB1_REG,     0x60040018
.equ APB_SARADC_SAR_PATT_TAB2_REG,     0x6004001C
.equ APB_SARADC_ONETIME_SAMPLE_REG,    0x60040020
.equ APB_SARADC_FILTER_CTRL0_REG,      0x60040028
.equ APB_SARADC_1_DATA_STATUS_REG,     0x6004002C
.equ APB_SARADC_THRES0_CTRL_REG,       0x60040034
.equ APB_SARADC_THRES1_CTRL_REG,       0x60040038
.equ APB_SARADC_THRES_CTRL_REG,        0x6004003C
.equ APB_SARADC_INT_ENA_REG,           0x60040040
.equ APB_SARADC_INT_RAW_REG,           0x60040044
.equ APB_SARADC_INT_ST_REG,            0x60040048
.equ APB_SARADC_INT_CLR_REG,           0x6004004C
.equ APB_SARADC_DMA_CONF_REG,          0x60040050
.equ APB_SARADC_APB_ADC_CLKM_CONF_REG, 0x60040054
.equ APB_SARADC_APB_TSENS_CTRL_REG,    0x60040058
.equ APB_SARADC_APB_TSENS_CTRL2_REG,   0x6004005C
# Version Register
.equ APB_SARADC_APB_CTRL_DATE_REG,     0x600403FC
######################################################